{
    "name":  "Configure OneDrive settings",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "settings":  [
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_allowtenantlist",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_allowtenantlist_1",
                    "children":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                            "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_allowtenantlist_allowtenantlistbox",
                            "settingInstanceTemplateReference":  null,
                            "simpleSettingCollectionValue":  [
                                {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference":  null,
                                    "value":  "8a9fe68d-1b39-4d97-adb4-b903fd42b30f"
                                }
                            ]
                        }
                    ]
                }
            }
        },
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_enableodignorelistfromgpo",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_enableodignorelistfromgpo_1",
                    "children":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                            "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv4~policy~onedrivengsc_enableodignorelistfromgpo_enableodignorelistfromgpolistbox",
                            "settingInstanceTemplateReference":  null,
                            "simpleSettingCollectionValue":  [
                                {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference":  null,
                                    "value":  "*.mp3"
                                },
                                {
                                    "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference":  null,
                                    "value":  "*.pst"
                                }
                            ]
                        }
                    ]
                }
            }
        },
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blockexternalsync",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_blockexternalsync_1",
                    "children":  [ ]
                }
            }
        },
        {
            "settingInstance":  {
            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
            "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinwithwizard",
            "settingInstanceTemplateReference":  null,
            "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinwithwizard_1",
                    "children":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinwithwizard_kfmoptinwithwizard_textbox",
                            "settingInstanceTemplateReference":  null,
                            "simpleSettingValue":  {
                                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference":  null,
                                "value":  "8a9fe68d-1b39-4d97-adb4-b903fd42b30f"
                            }
                        }
                    ]
                }
            }
        },
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_localmassdeletefiledeletethreshold",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_localmassdeletefiledeletethreshold_1",
                    "children":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv3~policy~onedrivengsc_localmassdeletefiledeletethreshold_lmdfiledeletethresholdbox",
                            "settingInstanceTemplateReference":  null,
                            "simpleSettingValue":  {
                                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
                                "settingValueTemplateReference":  null,
                                "value":  25
                            }
                        }
                    ]
                }
            }
        },
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1",
                    "children":  [ ]
                }
            }
        },
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_1",
                    "children":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown",
                            "settingInstanceTemplateReference":  null,
                            "choiceSettingValue":  {
                                "settingValueTemplateReference":  null,
                                "value":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_0",
                                "children":  [ ]
                            }
                        },
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox",
                            "settingInstanceTemplateReference":  null,
                            "simpleSettingValue":  {
                                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                "settingValueTemplateReference":  null,
                                "value":  "8a9fe68d-1b39-4d97-adb4-b903fd42b30f"
                            }
                        }
                    ]
                }
            }
        },
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1",
                    "children":  [ ]
                }
            }
        }
    ]
}
