{
    "name":  "Enable screen capture protection",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "settings":  [
        {
            "settingInstance":  {
                "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId":  "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_screen_capture_protection",
                "settingInstanceTemplateReference":  null,
                "choiceSettingValue":  {
                    "settingValueTemplateReference":  null,
                    "value":  "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_screen_capture_protection_1",
                    "children":  [
                        {
                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                            "settingDefinitionId":  "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_screen_capture_protection_avd_server_screen_capture_protection_level",
                            "settingInstanceTemplateReference":  null,
                            "choiceSettingValue":  {
                                "settingValueTemplateReference":  null,
                                "value":  "device_vendor_msft_policy_config_terminalserver-avdv1~policy~avd_gp_node_avd_server_screen_capture_protection_avd_server_screen_capture_protection_level_1",
                                "children":  [ ]
                            }
                        }
                    ]
                }
            }
        }
    ]
}
