{
    "name":  "Enable interactive logon banner (CIRCOR)",
    "description":  "",
    "platforms":  "windows10",
    "technologies":  "mdm",
    "settings":  [
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetextforusersattemptingtologon",
                                                 "settingInstanceTemplateReference":  null,
                                                 "simpleSettingCollectionValue":  [
                                                                                      {
                                                                                          "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                                          "settingValueTemplateReference":  null,
                                                                                          "value":  "This system is the property of CIRCOR and is intended for authorized users only. Employees and users of  CIRCOR’s Electronic Systems (including desktop computers, laptop computers, servers, mobile devices, email, Internet access, and business applications) should have no expectation of privacy with regard to use of these resources. All individuals’ activities while using CIRCOR’s Electronic Systems may be monitored and audited. By signing on and using any of these Electronic Systems, users acknowledge that all data, messages, documents, etc. sent, received, or reviewed while using these Electronic Systems are property of CIRCOR."
                                                                                      }
                                                                                  ]
                                             }
                     },
                     {
                         "settingInstance":  {
                                                 "@odata.type":  "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                                 "settingDefinitionId":  "device_vendor_msft_policy_config_localpoliciessecurityoptions_interactivelogon_messagetitleforusersattemptingtologon",
                                                 "settingInstanceTemplateReference":  null,
                                                 "simpleSettingValue":  {
                                                                            "@odata.type":  "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                                                            "settingValueTemplateReference":  null,
                                                                            "value":  "CIRCOR POC Terms of Use"
                                                                        }
                                             }
                     }
                 ]
}
